function flow(){
  var map = new google.maps.Map(document.getElementById("map"),
  {
    center: {lat:13.811468, lng:100.532135},
    schrollwheel: false,
    zoom: 11
  });

  for(var key in coords){
    coord = coords[key];
    if(coord.inlevel < 20){
      var image = "water_safe.png";
    }else if(coord.inlevel < 60){
      var image = "water_caution.png";
    }else{
      var image = "water_danger.png";
    }
    var latlng = new google.maps.LatLng(Number(coord.lat), Number(coord.lng));

    var marker = new google.maps.Marker({position: latlng, title: coord.name, icon: image});
    marker.setMap(map);
  }

  for(var from in path){
    for(var i = 0; i < path[from].length;i++){
      var to = path[from][i];
      var crdfrom = {lat: coords[from].lat, lng: coords[from].lng};
      var crdto = {lat: coords[to].lat, lng: coords[to].lng};

      var flowpath = new google.maps.Polyline({
        path: [crdfrom, crdto],
        geodesic: true,
        strokeColor: getColor(from, to),
        strokeOpacity: 0.75,
        strokeWeight: 8
      });
      flowpath.setMap(map);
    }
  }
}

function getColor(from, to){
  var lvl = (coords[from].outlevel + coords[to].inlevel)/2;
  if(lvl < 20) return "#8888FF";
  else if(lvl < 60) return "#88FF88";
  else return "#FF8888";
}

function getInlevel(i){
  return Math.random()*100;
}

function getOutlevel(i, inl){
  return inl + (Math.random()*20-10);
}

var coords = {};
var path;
init();

function init(){
  var database = [
    ['E00','Flood Control Center  (Din Dang)','ศูนย์ควบคุมระบบป้องกันน้ำท่วม','','ศูนย์ฯ','13.76924','100.55418','0','1','0'],
    ['E01','WG K. Song  (Sai Mai)','ปตร.คลองสอง','','คลองสอง','13.92294','100.63455','0','1','2'],
    ['E02','WG K. Phraya Surane  (Sai Mai)','ปตร.คลองพระยาสุเรนทร์','','พระยาสุเรนทร์','13.92087','100.6872','0','1','2'],
    ['E03','WG K. Samwa  (Khlong Samwa)','ปตร.คลองสามวา','','ค.สามวา','13.85958','100.72917','0','1','2'],
    ['E04','HS K. Bang Bua  (Bang Khen)','จุดวัดคลองบางบัว','','บางบัว','13.85794','100.5868','0','1','1'],
    ['E05','WG K. Ta Oot  (Lak Si)','ปตร.คลองตาอูฐ','','ตาอูฐ','13.89985','100.58645','0','1','2'],
    ['E06','HS K. Lumchala  (KannaYao)','จุดวัดคลองลำชะล่า','','ลำชะล่า','13.83637','100.66137','0','1','1'],
    ['E07','WG Pracha Ruamjai  (Min Buri)','ปตร.แสนแสบ-ประชาร่วมใจ','','ประชาร่วมใจ','13.82076','100.74728','0','1','2'],
    ['E08','PS K. Bang Khen Mai  (Bang Sue)','ส.คลองบางเขนใหม่','','บางเขนใหม่','13.81895','100.51256','0','1','2'],
    ['E09','WG K. Bueng Khwang  (Min Buri)','ปตร.คลองบึงขวาง','','บึงขวาง','13.79731','100.70442','0','1','2'],
    ['E10','PS K. Bang Sue  (Bang Sue)','ส.คลองบางซื่อ','','บางซื่อ','13.8001','100.51858','0','1','2'],
    ['E11','WG K.San Saeb-Bang Chan  (Bueng Kum)','ปตร.คลองแสนแสบ-บางชัน','','บางชัน','13.79731','100.70442','0','1','2'],
    ['E12','WG K. Lat Phrao  (Wang ThongLang)','ปตร.คลองลาดพร้าว','','ลาดพร้าว56','13.79403','100.58941','0','1','2'],
    ['E13','PS K. Sam Sen  (Dusit)','ส.คลองสามเสน','','สามเสน','13.78429','100.50859','0','1','2'],
    ['E14','HS K. Chao Khun Sing  (Wang ThongLang)','จุดวัดคลองเจ้าคุณสิงห์','','เจ้าคุณสิงห์','13.76172','100.61521','0','1','2'],
    ['E15','PS K. Thavate  (Pra Nakorn)','ส.คลองเทเวศน์','','เทเวศร์','13.77126','100.50162','0','1','2']
    ['E16','HS Anusawarichai  (RatChathewi)','จุดวัดอนุสาวรีย์ชัยสมรภูมิ','','รพ.พระมงกุฏฯ','13.76924','100.53507','0','1','1'],
    ['E17','HS Khet Bangkapi  (Bang Kapi)','จุดวัดเขตบางกะปิ','','ข.บางกะปิ','13.76509','100.64791','0','1','1'],
    ['E18','PS K. Samsen-Soonvijai  (Huai Khwang)','ส.คลองสามเสน-ศูนย์วิจัย','','ศูนย์วิจัย','13.74863','100.59895','0','1','2'],
    ['E19','PS K. Saen Saep-Klong Ton  (Watthana)','ส.คลองแสนแสบ-คลองตัน','','แสนแสบ-ค.ตัน','13.74128','100.5961','0','1','2'],
    ['E20','PS K. Krung Kasem  (Bang Rak)','ส.คลองกรุงเกษม','','กรุงเกษม','13.73057','100.51443','0','1','2'],
    ['E21','WG Lat Krabang  (Lat Krabang)','ปตร.ลาดกระบัง','','ลาดกระบัง','13.72445','100.68498','0','1','2'],
    ['E22','WG Wat Kratum Sua Pla  (Prawet)','ปตร.วัดกระทุ่มเสือปลา','','วัดกระทุ่มฯ','13.72411','100.6895','0','1','2'],
    ['E23','PS K. Sathorn  (Sathorn)','ส.คลองสาทร','','สาทร','13.71856','100.51514','0','1','3'],
    ['E24','HS Wat Kachornsiri  (Suan Luang)','จุดวัด วัดขจรศิริ','','ขจรศรี','13.72395','100.78391','0','1','1'],
    ['E25','PS RAMA 4  (Khlong Toei)','ส.พระราม 4','','พระราม4','13.7087','100.55457','0','1','0'],
    ['E26','PS K. Phrakanong  (Khlong Toei)','ส.คลองพระโขนง','','พระโขนง','13.70885','100.59524','0','1','2'],
    ['E27','PS K. Toei  (Khlong Toei)','ส.คลองเตย','','คลองเตย','13.70628','100.58752','0','1','2'],
    ['E28','PS K. Jek  (Pra Khanong)','ส.คลองเจ็ก','','คลองเจ็ก','13.69223','100.58991','0','1','2'],
    ['E29','PS K. Wat Sai  (Yannawa)','ส.คลองวัดไทร','','คลองวัดไทร','13.6871','100.51687','0','1','2'],
    ['E30','PS K. Bang Oa  (Pra Khanong)','ส.คลองบางอ้อ','','บางอ้อ','13.68212','100.59254','0','1','2'],
    ['E31','PS K. Bang Na  (Bang Na)','ส.คลองบางนา','','บางนา','13.67508','100.58731','0','1','2'],
    ['E32','HS K. Bang Na-Srinakarin  (Bang Na)','จุดวัดคลองบางนา-ศรีนครินทร์','','ถ.ศรีฯ','13.66106','100.63942','0','1','1'],
    ['E33','PS K. Sam Rong  (Samut Prakarn)','ส.คลองสำโรง','','สำโรง','13.64837','100.5953','0','1','2'],
    ['E34','WG K. San Saeb-Nong Chok  (Nong Chok)','ปตร.คลองแสนแสบ-หนองจอก','','หนองจอก','13.85535','100.87283','0','1','2'],
    ['E35','PS K. Chong Non See  (Yannawa)','ส.คลองช่องนนทรี','','ช่องนนนทรี','13.6953','100.54822','0','1','2'],
    ['E36','PS K. Bang Chark  (Pra Khanong)','ส.คลองบางจาก','','บางจาก','13.68904','100.59123','0','1','2'],
    ['E37','WG K. Wat Darn  (Bang Kholaem)','ปตร.คลองวัดด่าน','','คลองด่าน','13.671','100.54017','0','1','2'],
    ['E38','PS L. Ratchada-Wipawadee','ส.รัชดา-วิภาวดี (วิภาวดี)','','รัชดา-วิภา','13.83022','100.55723','0','1','1'],
    ['E39','WG K. Orachorn','ปตร.คลองอรชร (ปทุมวัน)','','อรชร','13.74551','100.53538','0','1','2'],
    ['E40','HS Suan Benchasiri','จุดวัด สวนเบญจสิริ (คลองเตย)','','เบญจสิริ','13.73159','100.56745','0','1','0'],
    ['E41','HS K. Kao-Watsrisuksathaporn','จัดวัดคลองเก้า-วัดศรีสุขสถาพร (คลองสามวา)','','ค.เก้า','13.92057','100.79238','0','1','1'],
    ['E42','HS K. Sibsong-Phachasamran rd.','จุดวัดคลองสิบสอง-ถนนประชาสำราญ (หนองจอก)','','ค.สิบสอง','13.91368','100.86244','0','1','1'],
    ['E43','WG K. Sibsam','ปตร.คลองสิบสาม (หนองจอก)','','ค.สิบสาม','13.85874','100.86779','0','1','2'],
    ['E44','HS K. Sansab-Wat Sub.Samosorn Nikorn','จัดวัดคลองแสนแสบ-วัดทรัพย์สโมสรนิกรเกษม','','วัดทรัพย์ฯ','13.85098','100.80256','0','1','1'],
    ['E45','WG K. Luang Pang','ปตร.หลวงแพ่ง (หนองจอก)','','หลวงแพ่ง','13.81302','100.93727','0','1','2'],
    ['E46','HS K. Bung Yai-Wat Thong Sum Rit','จุดวัดคลองบึงใหญ่-วัดทองสัมฤทธิ์ (มีนบุรี)','','บึงใหญ่','13.8005','100.78832','0','1','1'],
    ['E47','HS K. Lum Puk She-Lum Puk She School','จุดวัดคลองลำผักชี-โรงเรียนลำผักชี (หนองจอก)','','ลำผักชี','13.79221','100.83522','0','1','1'],
    ['E48','HS K. Pravet Bureerom-Khet Ladkrabang','จุดวัดคลองประเวศบุรีรมย์-สำนักงานเขตลาดกระบัง','','ข.ลาดกระบัง','13.72396','100.78399','0','1','1'],
    ['E49','HS K. Pravet Bureerom-Wat Rajkosa','จุดวัดคลองประเวศบุรีรมย์-วัดราชโกษา','','ราชโกษา','13.70102','100.85095','0','1','1'],
    ['E50','WG K. Bung Born-Bung Born Station','ส.บึงหนองบอน-ประเวศ','','หนองบอน','13.69529','100.65375','0','1','2'],
    ['W01','WG K. Thawi Watthana  (Thawi Watthana)','ปตร.คลองทวีวัฒนา','','ทวีวัฒนา','13.80042','100.32977','0','0','2'],
    ['W02','WG K. Bua  (Talingchan)','ปตร.คลองบัว','','คลองบัว','13.79974','100.41609','0','0','2'],
    ['W03','PS K. Chuck Phra  (Bangkok Noi)','ส.คลองชักพระ','','ชักพระ','13.77903','100.46457','0','0','2'],
    ['W04','PS K. Mon  (Bangkok Yai)','ส.คลองมอญ','','ค.มอญ','13.74703','100.48489','0','0','2'],
    ['W05','HS K. Bang Chuak Nang  (Talingchan)','จุดวัดคลองบางเชือกหนัง','','บางเชือกหนัง','13.74358','100.4238','0','0','1'],
    ['W06','PS K. Bangkok Yai  (Thon Buri)','ส.คลองบางกอกใหญ่','','บางกอกใหญ่','13.7402','100.48992','0','0','2'],
    ['W07','WG K. Phasi Charoen  (Phasicharoen)','ปตร.คลองภาษีเจริญ','','ภาษีเจริญ','13.72221','100.46868','0','0','2'],
    ['W08','HS Wat Nimmarn Norradee  (Phasicharoen)','จุดวัด วัดนิมมานนรดี','','ภาษี-ราชมนตรี','13.70763','100.42629','0','0','1'],
    ['W09','PS K. SamRae  (Thon Buri)','ส.คลองสำเหร่','','สำเหร่','13.70693','100.49639','0','0','2'],
    ['W10','HS K. Sanamchai  (Chom Thong)','จุดวัดคลองสนามชัย','','ค.สนามชัย','13.70123','100.46491','0','0','1'],
    ['W11','PS K. Dao Khanong  (Thon Buri)','ส.คลองดาวคนอง','','ดาวคะนอง','13.69504','100.48671','0','0','2'],
    ['W12','HS K. Thawee-PhasiCharoen  (Nong Kham)','จุดวัดคลองทวี-ภาษีเจริญ','','ทวี-ภาษี','13.69158','100.38118','0','0','1'],
    ['W13','PS K. SeeBath  (Bang Khunthian)','ส.คลองสี่บาท','','ค.สี่บาท','13.67317','100.44612','0','0','2'],
    ['W14','PS K. Chaeng Ron  (RatBurana)','ส.คลองแจงร้อน','','แจงร้อน','13.67634','100.52111','0','0','2'],
    ['W15','WG K. Rang Chark  (Thung Kru)','ปตร.คลองรางจาก','','รางจาก','13.63494','100.50218','0','0','2'],
    ['W16','PS K. Laen Paen  (Bang Khunthian)','ส.คลองเลนเปน','','เลนเปน','13.6072','100.41293','0','0','2'],
    ['W17','PS K. Raharn  (Bang Khunthian)','ส.คลองระหาญ','','ระหาญ','13.60381','100.39453','0','0','2'],
    ['W18','PS K. Praya Ratchamontri  (Bang Khunthian)','ส.คลองพระยาราชมนตรี','','ราชมนตรี','13.62817','100.43914','0','0','2'],
    ['W20','PS K. Bang Sai Kai  (Khlong San)','ส.คลองบางไส้ไก่','','บางไส้ไก่','13.70721','100.49718','0','0','2'],
    ['W21','WG K. Kun Sri Burirak(Thawi Watthana)','ปตร.คลองขุนศรีบุรีรักษ์ ตอนคลองมหาสวัสดิ์ เขตทวีวัฒนา','','ขุนศรีฯ','13.80244','100.3707','0','0','2'],
    ['W22','K. Bangkok Yai(Phasi Charoen)','คลองบางกอกใหญ่ ตอนคลองมอญ เขตภาษีเจริญ','','ปากน้ำฝั่งใต้','13.74365','100.45954','0','0','1'],
    ['W23','K. Thawi Watthana(Bang Khae)','คลองทวีวัฒนา ตอนคลองบางเชือกหนัง เขตบางแค','','ศาลาแดง','13.75037','100.35351','0','0','1'],
    ['W24','K. Phasi Charoen(Nong Khaem)','คลองภาษีเจริญ ตอนคลองบางน้ำจืด เขตหนองแขม','','มหาศร','13.68142','100.3504','0','0','1'],
    ['W25','K. Bang Bon(Bang Bon)','คลองบางบอน ตอนคลองสแกงาม เขตบางบอน','','บางบอน','13.64255','100.37952','0','0','1'],
    ['W26','PS K. Sanam Chai(Bang Khun Thian)','สถานีสูบน้ำคลองสนามชัย เขตบางขุนเทียน','','สนามชัย','13.6388','100.44755','0','0','2'],
  ];

  path = {
    "E12": ["E04"],
    "E45": ["E34", "E47"],
    "E34": ["E43"],
    "E43": ["E44", "E47"],
    "E44": ["E07"],
    "E47": ["E24"],
    "E46": ["E07"],
    "E07": ["E09"],
    "E24": ["E21"]
  };

  for(var i = 0; i < database.length; i++){
    inl = getInlevel(i);
    outl = getOutlevel(i, inl);
    coords[database[i][0]] = {name: database[i][0] + ": " + database[i][1],
     lat: Number(database[i][5]), lng: Number(database[i][6]), inlevel: inl, outlevel: outl}
  }
}
